// utils/yupSchemas/RegisterSchema.js
import * as yup from 'yup';

const RegisterSchema = yup.object().shape({
  name: yup
  .string()
  .required("نام الزامی است.")
  .max(50, "نام حداکثر 50 کاراکتر می‌تواند باشد."),

  username: yup
    .string()
    .min(3, 'نام کاربری باید حداقل 3 کاراکتر باشد')
    .max(30, 'نام کاربری نمی‌تواند بیش از 30 کاراکتر باشد')
    .required('نام کاربری الزامی است'),
  password: yup
    .string()
    .min(8, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[a-z]/,"پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[A-Z]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[0-9]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[!@#$%^&*(),.?":{}|<>]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .required("وارد کردن فیلد پسورد اجباری است"),

  phone: yup
    .string()
    .matches(/^[۰-۹0-9]{11}$/
    , "شماره تلفن وارد شده معتبر نیست")
    .required("وارد کردن فیلد شماره تلفن الزامیست "),
 

});

export default RegisterSchema;



// import * as yup from "yup";

// // *******************validate********************
// const RegisterSchema = yup.object().shape({
 
//   username: yup
//     .string()
//     .max(25, "نام کاربری نمی‌تواند بیشتر از 25 کاراکتر باشد")
//     .required("وارد کردن فیلد نام کاربری اجباری است"),
//   password: yup
//     .string()
//     .min(8, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
//     .matches(/[a-z]/,"پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
//     .matches(/[A-Z]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
//     .matches(/[0-9]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
//     .matches(/[!@#$%^&*(),.?":{}|<>]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
//     .required("وارد کردن فیلد پسورد اجباری است"),

//     phone: yup
//     .string()
//     .matches(/^[۰-۹0-9]{11}$/
//     , "شماره تلفن وارد شده معتبر نیست")
//     .required("وارد کردن فیلد شماره تلفن الزامیست "),
//   // rePassword: yup.string().nullable().oneOf([yup.ref("password"), null],
//   //     "تکرار رمز عبور باید با رمز عبور مطابقت داشته باشد"
//   //   )
//   //   .required("وارد کردن فیلد تکرار رمز عبور اجباری است"),
// });

// export default RegisterSchema;
