import * as yup from "yup";

// *******************validate********************
const RegisterSchema = yup.object().shape({
  email: yup
    .string()
    .email("ایمیل وارد شده معتبر نمی باشد")
    .required("وارد کردن فیلد ایمیل اجباری است"),
 
  password: yup
    .string()
    .min(8, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[a-z]/,"پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[A-Z]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[0-9]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .matches(/[!@#$%^&*(),.?":{}|<>]/, "پسورد باید حداقل 8 کاراکتر باشد، شامل حروف کوچک و بزرگ و یک عدد و یک نشانه")
    .required("وارد کردن فیلد پسورد اجباری است"),
  
});

export default RegisterSchema;
