import * as yup from 'yup';

const ProductsSchema = yup.object().shape({
  title: yup.string()
  .required('عنوان محصول الزامی است')
  .min(3, 'عنوان باید حداقل 3 کاراکتر باشد')
  .max(100, 'عنوان نباید بیش از 100 کاراکتر باشد'),
  /////////////////////////////
  unit: yup.string()
  .required('واحد کالا الزامی است')
  .min(2, 'واحد کالا باید حداقل 2 کاراکتر باشد')
  .max(100, 'واحد کالا نباید بیش از 100 کاراکتر باشد'),
  //////////////////////////
  tags: yup.array()
  .of(
    yup.object().shape({
      label: yup.string()
        .min(2, 'هر تگ باید حداقل ۲ کاراکتر باشد')
        .max(30, 'هر تگ نباید بیش از ۳۰ کاراکتر باشد')
        .required('تگ نیاز به برچسب دارد'),
      value: yup.string()
        .min(2, 'هر تگ باید حداقل ۲ کاراکتر باشد')
        .max(30, 'هر تگ نباید بیش از ۳۰ کاراکتر باشد')
        .required('تگ نیاز به مقدار دارد'),
    })
  )
  .min(1, 'باید حداقل یک تگ وارد کنید')
  .max(10, 'حداکثر ۱۰ تگ قابل قبول است'),
/////////////////////////////////////
  // generalFeatures: yup.array()
  // .of(
  //   yup.object().shape({
  //     label: yup.string()
  //       .min(2, 'هر ویژگی باید حداقل ۲ کاراکتر باشد')
  //       .max(30, 'هر ویژگی نباید بیش از ۳۰ کاراکتر باشد')
  //       .required('ویژگی نیاز به برچسب دارد'),
  //     value: yup.string()
  //       .min(2, 'هر ویژگی باید حداقل ۲ کاراکتر باشد')
  //       .max(30, 'هر ویژگی نباید بیش از ۳۰ کاراکتر باشد')
  //       .required('ویژگی نیاز به مقدار دارد'),
  //   })
  // )
  // .min(1, 'باید حداقل یک ویژگی وارد کنید')
  // .max(10, 'حداکثر ۱۰ ویژگی قابل قبول است'),
  Features: yup.array()
  .of(
    yup.object().shape({
      featureKey: yup.object()
        .nullable()
        .required('انتخاب کلید ویژگی الزامی است'),
      value: yup.string()
        .required('مقدار ویژگی الزامی است')
        .min(1, 'مقدار ویژگی نباید خالی باشد'),
    })
  )
  .min(1, 'حداقل یک ویژگی باید اضافه شود')
  .required('فیلد ویژگی‌ها الزامی است'),
//////////////////////////
  pricingTemplate:yup.string()
        .required(' قالب قیمتی الزامی است'),
  /////////////////////////
  images: yup.array()
    .of(
      yup.object().shape({
        url: yup.string()
          .url('آدرس تصویر نامعتبر است')
          .required('آدرس تصویر الزامی است'),
              })
    )
    .max(10, 'حداکثر 10 تصویر قابل اضافه کردن است'),
////////////////////////////////////////
  // سایر فیلدهای لازم را به همین صورت اضافه کنید
});

export default ProductsSchema;
  