
function AbuteDescription() {
  return (
    <div className="flex-col space-y-5 mx-5 max-w-[450px]">
      <h1 className="logoName text-xl  font-MorabbaBold line-clamp-2">فود رویا استارت آپی برای تامین مواد غذایی خانواده</h1>
      <h4 className="logoName text-sm font-MorabbaMedium line-clamp-6">استارت آپ فود رویا در سال ۱۴۰۲ فعالیت خود را شهرستان قائمشهر و
       در زمینه مواد غذایی با هدف تامین مواد غذایی و خوراکی های خانواده
        آغاز نمود و تاکنون در زمینه تولید انواع سوسیس و کالباس، ناگت و فلافل ، فینگر فود ، همبرگر ،
        شیرینی های خانگی و کیک ، انواع بیسکویت  و انواع غذاهای نیمه آماده فعالیت خود را ادامه داد.
        این مجموعه قصد دارد با بکار گیری جدیدترین دستگاهها و ترکیب تکنولژی با دستپخت مادرانه ، به مادران عزیز در آشپزی و پخت غذای سالم و خوشمزه کمک نماید .
        
        </h4>

    </div>
  )
}

export default AbuteDescription
